/*
 *  This program is free software; you can redistribute it and/or modify it
 *  under the terms of the GNU General Public License version 2 as published
 *  by the Free Software Foundation.
 *
 *  Copyright (C) 2020 Alexey Spirkov <dev@alsp.net>
 */

#include <linux/module.h>
#include <linux/serial.h>
#include <linux/console.h>
#include <linux/sysrq.h>
#include <linux/platform_device.h>
#include <linux/types.h>
#include <linux/sizes.h>
#include <linux/tty.h>
#include <linux/tty_flip.h>
#include <linux/serial_core.h>
#include <linux/io.h>
#include <linux/of_irq.h>
#include <linux/of_address.h>
#include <linux/clk.h>
#include <linux/dmaengine.h>
#include <linux/dma-mapping.h>
#include <linux/scatterlist.h>
#include <linux/delay.h>
#include "../../dma/rcm-mdma.h"

#define MUART_ID 0x55415254
#define MUART_VERSION 0x10190

#define MUART_TX_FIFO_SIZE 0x3ff
#define MUART_RX_FIFO_SIZE 0x3ff
#define MUART_FIFO_MASK 0x7ff

//MUART_CTRL
#define MUART_CTRL_MEN_i 0
#define MUART_CTRL_LBE_i 1
#define MUART_CTRL_APB_MD_i 2
#define MUART_CTRL_MDS_i 3
#define MUART_CTRL_RTSen_i 4
#define MUART_CTRL_CTSen_i 5
#define MUART_CTRL_RTS_POL 6
#define MUART_CTRL_PEN_i 7
#define MUART_CTRL_EPS_i 8
#define MUART_CTRL_SPS_i 9
#define MUART_CTRL_STP2_i 10
#define MUART_CTRL_WLEN_i 12
#define MUART_CTRL_DUM_i 15

//MUART_BDIV
#define MUART_BAUD_DIV_i 0
#define MUART_N_DIV 24

//MUART_FIFO_STATE
#define MUART_RXFS_i 0
#define MUART_TXFS_i 16

//MUART_DREG

#define MUART_IRQ_ST_MSK_START_BY_EVENT (1<<8) // An external event triggered the launch
#define MUART_IRQ_ST_MSK_IGNORE_EVENT (1<<9) // The event triggering MDMA occurred while MDMA was active
#define MUART_IRQ_ST_MSK_FULL ((1<<10)-1) // All interrupt types enabled

#define MUART_TX_DESC_CNT 8
#define MUART_RX_DESC_CNT 2
#define MAURT_DESC_GAP (sizeof(struct mdma_desc_long_ll))

#define MUART_TX_DESC_POOL_SIZE (MUART_TX_DESC_CNT*sizeof(struct mdma_desc_long_ll))
#define MUART_RX_DESC_POOL_SIZE (MUART_RX_DESC_CNT*sizeof(struct mdma_desc_long_ll))

#define MUART_MDMA_DESC_BUF_SIZE (1<<14)

#define MUART_MDMA_RX_TIMEOUT 5000	// in bit intervals
#define MUART_MDMA_TXRX_SETTINGS ((MAURT_DESC_GAP << 16) | (1<<4) | 2)

// MUART_GEN_STATUS
#define MUART_IRQ 0x01 // MUART interrupt
#define MDMA_RD_IRQ 0x02 // MDMA read channel interrupt  
#define MDMA_WR_IRQ 0x04 // MDMA write channel interrupt 

// For debug purpose
#define dev_dbg_(dev,...) printk(__VA_ARGS__);

#define DBGP printk("%s(%u)",__FILE__,__LINE__);

#define PRINT_ASYNC_DESCR(DESCR) printk("%s,%u(%s),Desc:hw_desc=%08x,memptr=%08x,fllen=%08x,buf=%08x,phys=%08x\n", \
										__FILE__, __LINE__,  __func__, \
										(unsigned int)DESCR->hw_desc, DESCR->hw_desc->memptr, DESCR->hw_desc->flags_length, \
										(unsigned int)DESCR->buf, DESCR->phys);
#define PRINT_BIT(OBJ,BIT) printk("%s:%u\n", #BIT, OBJ&BIT?1:0);
#define PRINT_DMA_STAT(ST) \
	PRINT_BIT(ST, MUART_IRQ_ST_MSK_SUSPEND_DONE) \
	PRINT_BIT(ST, MUART_IRQ_ST_MSK_CANCEL_DONE) \
	PRINT_BIT(ST, MUART_IRQ_ST_MSK_INT_DESC) \
	PRINT_BIT(ST, MUART_IRQ_ST_MSK_BAD_DESC) \
	PRINT_BIT(ST, MUART_IRQ_ST_MSK_STOP_DESC) \
	PRINT_BIT(ST, MUART_IRQ_ST_MSK_DISCARD_DESC) \
	PRINT_BIT(ST, MUART_IRQ_ST_MSK_WAXI_ERR) \
	PRINT_BIT(ST, MUART_IRQ_ST_MSK_AXI_ERR) \
	PRINT_BIT(ST, MUART_IRQ_ST_MSK_START_BY_EVENT) \
	PRINT_BIT(ST, MUART_IRQ_ST_MSK_IGNORE_EVENT)
#define PRINT_CUSTOM_FLAGS(FL) \
	PRINT_BIT(FL, MDMA_MUART_FLAG_RTR) \
	PRINT_BIT(FL, MDMA_MUART_FLAG_TFL) \
	PRINT_BIT(FL, MDMA_MUART_FLAG_OER) \
	PRINT_BIT(FL, MDMA_MUART_FLAG_BER) \
	PRINT_BIT(FL, MDMA_MUART_FLAG_PER) \
	PRINT_BIT(FL, MDMA_MUART_FLAG_FER) \
	printk("Length=%u\n", FL&(MUART_MDMA_DESC_BUF_SIZE-1))

#define PRINT_BUF(BUF,LEN) printk("Length=%u;Buffer=%02x,%02x,%02x,%02x,%02x,%02x,%02x,%02x..%02x..%02x,%02x,%02x,%02x,%02x,%02x,%02x,%02x\n", \
	LEN, \
	((char*)BUF)[0], ((char*)BUF)[1], ((char*)BUF)[2], ((unsigned char*)BUF)[3], \
	((char*)BUF)[4], ((char*)BUF)[5], ((char*)BUF)[6], ((unsigned char*)BUF)[7], \
	((char*)BUF)[1088], \
	((char*)BUF)[LEN-8], ((char*)BUF)[LEN-7], ((char*)BUF)[LEN-6], ((char*)BUF)[LEN-5], \
	((char*)BUF)[LEN-4], ((char*)BUF)[LEN-3], ((char*)BUF)[LEN-2], ((char*)BUF)[LEN-1]);

#define PRINT_TERMIOS(TRM) \
	printk("c_iflag: %08x\n", TRM->c_iflag); \
	printk("c_iflag: %08x\n", TRM->c_oflag); \
	printk("c_iflag: %08x\n", TRM->c_cflag); \
	printk("c_iflag: %08x\n", TRM->c_lflag); \
	printk("c_line: %08x\n", TRM->c_line);

/*
 *Information about a serial port
 *
 * @base: Register base address
 */

struct muart_regs {
	unsigned long id; // 0x000
	unsigned long version; // 0x004
	unsigned long sw_rst; // 0x008
	unsigned long reserve_1; // 0x00C
	unsigned long gen_status; // 0x010
	unsigned long fifo_state; // 0x014
	unsigned long status; // 0x018
	unsigned long reserve_2; // 0x01C
	unsigned long dtrans; // 0x020
	unsigned long reserve_3; // 0x024
	unsigned long drec; // 0x028
	unsigned long reserve_4; // 0x02C
	unsigned long bdiv; // 0x030
	unsigned long reserve_5; // 0x034
	unsigned long reserve_6; // 0x038
	unsigned long reserve_7; // 0x03C
	unsigned long fifowm; // 0x040
	unsigned long ctrl; // 0x044
	unsigned long mask; // 0x048
	unsigned long rxtimeout; // 0x04C
	unsigned long reserve_8; // 0x050
	unsigned long txtimeout; // 0x054
	unsigned long reserve_58[42];
	unsigned long tx_enable_r; // 0х0100
	unsigned long tx_suspend_r; // 0х0104
	unsigned long tx_cancel_r; // 0х0108
	unsigned long reserve_10C; // 0x010C 
	unsigned long tx_settings_r; // 0x0110
	unsigned long tx_irq_mask_r; // 0x0114
	unsigned long tx_status_r; // 0x0118
	unsigned long reserve_11C; // 0x011C
	unsigned long tx_desc_addr_r; // 0x0120
	unsigned long reserve_124; // 0x0124
	unsigned long tx_cur_desc_addr_r; // 0x0128
	unsigned long tx_cur_addr_r; // 0x012C
	unsigned long tx_dma_state_r; // 0x0130
	unsigned long reserve_134; // 0x0134
	unsigned long reserve_138; // 0x0138
	unsigned long reserve_13C; // 0x013C
	unsigned long tx_desc_axlen_r; // 0x0140
	unsigned long tx_desc_acache_r; // 0x0144
	unsigned long tx_desc_aprot_r; // 0x0148
	unsigned long tx_desc_alock_r; // 0x014C
	unsigned long tx_desc_rresp_r; // 0x0150
	unsigned long tx_desc_raxi_err_addr_r; // 0x0154
	unsigned long tx_desc_bresp_r; // 0x0158
	unsigned long tx_desc_waxi_err_addr_r; // 0x015C
	unsigned long tx_desc_permut_r; // 0x0160
	unsigned long reserve_164; // 0x0164
	unsigned long reserve_168; // 0x0168
	unsigned long reserve_16C; // 0x016C
	unsigned long reserve_170; // 0x0170
	unsigned long reserve_174; // 0x0174
	unsigned long reserve_178; // 0x0178
	unsigned long reserve_17C; // 0x017C 
	unsigned long tx_r_max_trans; // 0x0180
	unsigned long tx_arlen; // 0x0184
	unsigned long tx_arcache; // 0x0188
	unsigned long tx_arprot; // 0x018C
	unsigned long tx_arlock; // 0x0190
	unsigned long tx_rresp; // 0x0194
	unsigned long tx_raxi_err_addr; // 0x0198
	unsigned long reserve_19C; // 0x019C
	unsigned long tx_raxi_state; // 0x01A0
	unsigned long tx_r_available_space; // 0x01A4  
	unsigned long tx_r_permutation; // 0x01A8  
	unsigned long reserve_1AC; // 0x01AC
	unsigned long reserve_1B0; // 0x01B0
	unsigned long reserve_1B4; // 0x01B4
	unsigned long reserve_1B8; // 0x01B8
	unsigned long reserve_1BC; // 0x01BC
	unsigned long reserve_1C0[16]; // 0x01C0..0x01FF
	unsigned long rx_enable_w; // 0x0200
	unsigned long rx_suspend_w; // 0x0204
	unsigned long rx_cancel_w; // 0x0208
	unsigned long reserve_20C; // 0x020C
	unsigned long rx_settings_w; // 0x0210
	unsigned long rx_irq_mask_w; // 0x0214
	unsigned long rx_status_w; // 0x0218
	unsigned long reserve_21C; // 0x021C
	unsigned long rx_desc_addr_w; // 0x0220
	unsigned long reserve_224; // 0x0224
};

struct muart_port;

/* Deals with DMA transactions */

struct muart_sgbuf {
	struct scatterlist sg;
	char *buf;
};

struct muart_async_descriptor {
	void* buf;
	unsigned int off;
	struct mdma_desc_long_ll* hw_desc;
	dma_addr_t phys;
	struct list_head free;
	struct list_head pending;
	struct list_head completed;
};

struct muart_dma_data {
	bool running;
	struct completion ready;
	struct completion suspend;
	struct completion cancel;
	struct tasklet_struct tasklet;
	struct mdma_desc_long_ll* hw_descr_pool;
	dma_addr_t hw_descr_pool_phys;
	struct muart_async_descriptor* working_descr;
	struct list_head free_list;
	struct list_head pending_list;
	struct list_head completed_list;
	struct muart_async_descriptor* descr;
	spinlock_t lock;
};

struct muart_port {
	struct uart_port port;
	struct clk *clk;
	unsigned long baud;
	/* DMA stuff */
	bool using_dma;
	bool loopback;
	struct muart_async_descriptor rx_descr[MUART_RX_DESC_CNT];
