/*
 *  This program is free software; you can redistribute it and/or modify it
 *  under the terms of the GNU General Public License version 2 as published
 *  by the Free Software Foundation.
 *
 *  Copyright (C) 2020 Alexey Spirkov <dev@alsp.net>
 */

#include <linux/module.h>
#include <linux/serial.h>
#include <linux/console.h>
#include <linux/sysrq.h>
#include <linux/platform_device.h>
#include <linux/types.h>
#include <linux/sizes.h>
#include <linux/tty.h>
#include <linux/tty_flip.h>
#include <linux/serial_core.h>
#include <linux/io.h>
#include <linux/of_irq.h>
#include <linux/of_address.h>
#include <linux/clk.h>
#include <linux/dmaengine.h>
#include <linux/dma-mapping.h>
#include <linux/scatterlist.h>
#include "../../dma/rcm-mdma.h"

#define MUART_ID 0x55415254
#define MUART_VERSION 0x10190

#define MUART_TX_FIFO_SIZE 0x3ff
#define MUART_RX_FIFO_SIZE 0x3ff
#define MUART_FIFO_MASK 0x7ff

//MUART_CTRL
#define MUART_CTRL_MEN_i 0
#define MUART_CTRL_LBE_i 1
#define MUART_CTRL_APB_MD_i 2
#define MUART_CTRL_MDS_i 3
#define MUART_CTRL_RTSen_i 4
#define MUART_CTRL_CTSen_i 5
#define MUART_CTRL_RTS_POL 6
#define MUART_CTRL_PEN_i 7
#define MUART_CTRL_EPS_i 8
#define MUART_CTRL_SPS_i 9
#define MUART_CTRL_STP2_i 10
#define MUART_CTRL_WLEN_i 12
#define MUART_CTRL_DUM_i 15

//MUART_BDIV
#define MUART_BAUD_DIV_i 0
#define MUART_N_DIV 24

//MUART_FIFO_STATE
#define MUART_RXFS_i 0
#define MUART_TXFS_i 16

//MUART_DREG
#define MUART_DREG_FE (1 << 12) // frame error
#define MUART_DREG_PE (1 << 13) // parity error
#define MUART_DREG_BE (1 << 14) // break error
#define MUART_DREG_OE (1 << 15) // overflow error
#define MUART_DREG_DUMMY_RX (1 << 16) // dummy flag
#define MUART_DREG_ERR                                                         \
	(MUART_DREG_FE | MUART_DREG_PE | MUART_DREG_BE | MUART_DREG_OE)

// MUART_FIFOWM shifts
#define MUART_FIFOWM_RXFS_i 0
#define MUART_FIFOWM_TXFS_i 16

//MUART_STATUS /MASK
#define MUART_IRQ_RX 0x01 // RX IRQ
#define MUART_IRQ_TX 0x02 // TX IRQ
#define MUART_IRQ_RTR 0x04 // RX timeout
#define MUART_IRQ_FER 0x08 // Stop bit error
#define MUART_IRQ_PER 0x08 // Parity bit error
#define MUART_IRQ_BER 0x10 // Line hangup error
#define MUART_IRQ_RER 0x20 // RX FIFO overflow
#define MUART_IRQ_TER 0x40 // TX FIFO overflow
#define MUART_IRQ_TTR 0x80 // TX CTS error

/*
 *Information about a serial port
 *
 * @base: Register base address
 */

struct muart_regs {
	unsigned long id; // 0x000
	unsigned long version; // 0x004
	unsigned long sw_rst; // 0x008
	unsigned long reserve_1; // 0x00C
	unsigned long gen_status; // 0x010
	unsigned long fifo_state; // 0x014
	unsigned long status; // 0x018
	unsigned long reserve_2; // 0x01C
	unsigned long dtrans; // 0x020
	unsigned long reserve_3; // 0x024
	unsigned long drec; // 0x028
	unsigned long reserve_4; // 0x02C
	unsigned long bdiv; // 0x030
	unsigned long reserve_5; // 0x034
	unsigned long reserve_6; // 0x038
	unsigned long reserve_7; // 0x03C
	unsigned long fifowm; // 0x040
	unsigned long ctrl; // 0x044
	unsigned long mask; // 0x048
	unsigned long rxtimeout; // 0x04C, Определяет тайм-аут,в битовых интервалах,при превышении которого при приёме данных возникает соответствующее прерывание
	unsigned long reserve_8; // 0x050  В наиболее частом случае посылка байта занимает 10 интервалов. DMA максимальный размер 16383 байта. Пока 200. На 9800 это ~ 20 мс.
	unsigned long txtimeout; // 0x054
	unsigned long reserve_58[42];
	unsigned long tx_enable_r;				// 0х0100, Включение/выключение канала
	unsigned long tx_suspend_r;				// 0х0104, Приостановка работы канала
	unsigned long tx_cancel_r;				// 0х0108, Остановка работы канала с точностью до дескриптора
	unsigned long reserve_10C;				// 0x010C 
	unsigned long tx_settings_r;			// 0x0110, Настройка канала
	unsigned long tx_irq_mask_r;			// 0x0114, Маска прерываний канала
	unsigned long tx_status_r;				// 0x0118, Состояние линии прерываний канала
	unsigned long reserve_11C;				// 0x011C
	unsigned long tx_desc_addr_r;			// 0x0120, Адрес первого дескриптора
	unsigned long reserve_124;				// 0x0124
	unsigned long tx_cur_desc_addr_r;		// 0x0128, Адрес текущего дескриптора
	unsigned long tx_cur_addr_r;			// 0x012C, Адрес текущей транзакции
	unsigned long tx_dma_state_r;			// 0x0130, Регистр состояния канала
	unsigned long reserve_134;				// 0x0134
	unsigned long reserve_138;				// 0x0138
	unsigned long reserve_13C;				// 0x013C
	unsigned long tx_desc_axlen_r;			// 0x0140
	unsigned long tx_desc_acache_r;			// 0x0144
	unsigned long tx_desc_aprot_r;			// 0x0148
	unsigned long tx_desc_alock_r;			// 0x014C
	unsigned long tx_desc_rresp_r;			// 0x0150
	unsigned long tx_desc_raxi_err_addr_r; 	// 0x0154
	unsigned long tx_desc_bresp_r;			// 0x0158
	unsigned long tx_desc_waxi_err_addr_r;	// 0x015C
	unsigned long tx_desc_permut_r;			// 0x0160
	unsigned long reserve_164;				// 0x0164
	unsigned long reserve_168;				// 0x0168
	unsigned long reserve_16C;				// 0x016C
	unsigned long reserve_170;				// 0x0170
	unsigned long reserve_174;				// 0x0174
	unsigned long reserve_178;				// 0x0178
	unsigned long reserve_17C;				// 0x017C 
	unsigned long tx_r_max_trans;			// 0x0180
	unsigned long tx_arlen;					// 0x0184
	unsigned long tx_arcache;				// 0x0188
	unsigned long tx_arprot;				// 0x018C
	unsigned long tx_arlock;				// 0x0190
	unsigned long tx_rresp;					// 0x0194
	unsigned long tx_raxi_err_addr;			// 0x0198
	unsigned long reserve_19C;				// 0x019C
	unsigned long tx_raxi_state;			// 0x01A0
	unsigned long tx_r_available_space;		// 0x01A4  
	unsigned long tx_r_permutation;			// 0x01A8  
	unsigned long reserve_1AC;				// 0x01AC
	unsigned long reserve_1B0;				// 0x01B0
	unsigned long reserve_1B4;				// 0x01B4
	unsigned long reserve_1B8;				// 0x01B8
	unsigned long reserve_1BC;				// 0x01BC
	unsigned long reserve_1C0[16];			// 0x01C0..0x01FF
	unsigned long rx_enable_w;				// 0x0200, Включение/выключение канала
	unsigned long rx_suspend_w;				// 0x0204, Приостановка работы канала
	unsigned long rx_cancel_w;				// 0x0208, Остановка работы канала с точностью до дескриптора
	unsigned long reserve_20C;				// 0x020C
	unsigned long rx_settings_w;			// 0x0210, Настройка канала
	unsigned long rx_irq_mask_w;			// 0x0214, Маска прерываний канала
	unsigned long rx_status_w;				// 0x0218, Состояние линии прерываний канала
	unsigned long reserve_21C;				// 0x021C
	unsigned long rx_desc_addr_w;			// 0x0220, Адрес первого дескриптора
	unsigned long reserve_224;				// 0x0224
};

// Custom flags
#define MDMA_MUART_FLAG_RTR 				(1<<19)	// 115,Ошибка таймаута
#define MDMA_MUART_FLAG_TFL 				(1<<18) // 114,Ошибка потери временной метки
#define MDMA_MUART_FLAG_OER 				(1<<17) // 113,Было переполнение FIFO
#define MDMA_MUART_FLAG_BER					(1<<16) // 112,Ошибка обрыва линии
#define MDMA_MUART_FLAG_PER 				(1<<15) // 111,Ошибка четности
#define MDMA_MUART_FLAG_FER 				(1<<14) // 110,Ошибка стопового бита

#define MUART_IRQ_ST_MSK_SUSPEND_DONE		(1<<0)	// Завершено выполнение приостановки MDMA
#define MUART_IRQ_ST_MSK_CANCEL_DONE		(1<<1)	// Завершена остановка MDMA (cancel) 
#define MUART_IRQ_ST_MSK_INT_DESC			(1<<2)	// Завершено выполнение дескриптора с флагом Int 
#define MUART_IRQ_ST_MSK_BAD_DESC			(1<<3)	// Считан дескриптор недоступный для MDMA (флаг ownership равен 1) 
#define MUART_IRQ_ST_MSK_STOP_DESC			(1<<4)	// Завершено выполнение дескриптора с флагом Stop 
